chain-a.txt
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloada -p rocksdb.dir=/tmp/ycsb-rocksdb-data -threads 16
communicating with replicator at 128.110.154.79:50050
tail get: 1
tail put: 9
tail get: 1
tail put: 9
tail get: 9
tail put: 1
tail get: 4
tail put: 6
tail get: 8
tail put: 2
tail get: 4
tail put: 6
tail get: 9
tail put: 1
tail get: 6
tail put: 4
tail get: 7
tail put: 3
tail get: 7
tail put: 3
tail get: 8
tail put: 2
tail get: 5
tail put: 5
tail get: 7
tail put: 3
tail get: 4
tail put: 6
recvCount: 93750 met target
returned from latch for thread 45
recvCount: 93750 met target
returned from latch for thread 70
recvCount: 93750 met target
returned from latch for thread 23
recvCount: 93750 met target
returned from latch for thread 34
recvCount: 93750 met target
returned from latch for thread 69
recvCount: 93750 met target
returned from latch for thread 56
recvCount: 93750 met target
returned from latch for thread 38
recvCount: 93750 met target
returned from latch for thread 58
recvCount: 93750 met target
returned from latch for thread 30
recvCount: 93750 met target
returned from latch for thread 27
recvCount: 93750 met target
returned from latch for thread 54
recvCount: 93750 met target
returned from latch for thread 49
recvCount: 93750 met target
returned from latch for thread 57
recvCount: 93750 met target
returned from latch for thread 42
recvCount: 93750 met target
returned from latch for thread 60
recvCount: 93750 met target
returned from latch for thread 59
[OVERALL], RunTime(ms), 27321
[OVERALL], Throughput(ops/sec), 54902.82200505106
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 716
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.6206947037077706
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 716
[TOTAL_GC_TIME_%], Time(%), 2.6206947037077706
[READ], Operations, 749840
[READ], AverageLatency(us), 232.16288941640883
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 24838143
[READ], 95thPercentileLatency(us), 3
[READ], 99thPercentileLatency(us), 6
[READ], Return=OK, 749840
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 230.6875
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 3595
[CLEANUP], 95thPercentileLatency(us), 17
[CLEANUP], 99thPercentileLatency(us), 3595
[UPDATE], Operations, 750160
[UPDATE], AverageLatency(us), 311.3888930361523
[UPDATE], MinLatency(us), 0
[UPDATE], MaxLatency(us), 24625151
[UPDATE], 95thPercentileLatency(us), 9
[UPDATE], 99thPercentileLatency(us), 19
[UPDATE], Return=OK, 750160