chain-b.txt
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadb -p rocksdb.dir=/tmp/ycsb-rocksdb-data -threads 16
communicating with replicator at 128.110.154.79:50050
tail get: 3
tail put: 7
tail get: 6
tail put: 4
tail get: 1
tail get: 5
tail put: 5
tail get: 1
tail put: 9
tail put: 9
tail get: 4
tail put: 6
tail get: 6
tail put: 4
tail get: 7
tail put: 3
tail get: 5
tail put: 5
tail get: 4
tail put: 6
tail get: 8
tail put: 2
tail get: 4
tail put: 6
tail get: 4
tail put: 6
tail get: 4
tail put: 6
tail get: 8
tail put: 2
tail get: 9
tail put: 1
recvCount: 93750 met target
returned from latch for thread 41
recvCount: 93750 met target
returned from latch for thread 69
recvCount: 93750 met target
returned from latch for thread 54
recvCount: 93750 met target
returned from latch for thread 67
recvCount: 93750 met target
returned from latch for thread 56
recvCount: 93750 met target
returned from latch for thread 50
recvCount: 93750 met target
recvCount: 93750 met target
returned from latch for thread 57
returned from latch for thread 38
recvCount: 93750 met target
returned from latch for thread 27
recvCount: 93750 met target
returned from latch for thread 45
recvCount: 93750 met target
returned from latch for thread 33
recvCount: 93750 met target
returned from latch for thread 70
recvCount: 93750 met target
returned from latch for thread 23
recvCount: 93750 met target
returned from latch for thread 30
recvCount: 93750 met target
returned from latch for thread 68
recvCount: 93750 met target
returned from latch for thread 58
[OVERALL], RunTime(ms), 11890
[OVERALL], Throughput(ops/sec), 126156.43397813289
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 482
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 4.053826745164003
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 482
[TOTAL_GC_TIME_%], Time(%), 4.053826745164003
[READ], Operations, 1424629
[READ], AverageLatency(us), 118.28646545872645
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 10567679
[READ], 95thPercentileLatency(us), 1
[READ], 99thPercentileLatency(us), 5
[READ], Return=OK, 1424629
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 219.4375
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 3409
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 3409
[UPDATE], Operations, 75371
[UPDATE], AverageLatency(us), 24.55971129479508
[UPDATE], MinLatency(us), 0
[UPDATE], MaxLatency(us), 107839
[UPDATE], 95thPercentileLatency(us), 10
[UPDATE], 99thPercentileLatency(us), 61
[UPDATE], Return=OK, 75371